app/views/static_pages/home.html.erb

    <div class="col-sm-6" style=" font-size:64px;width: 250px; height: 250px; background: red; border-radius: 50%; ">
      <p style="position:relative; left:90px;top:65px;"><%= Property.count %></p>
---
SELECT `properties`.* FROM `properties` WHERE (`properties`.`created_at` BETWEEN '2017-08-11 18:30:00' AND '2017-08-12 18:30:00')