app/views/users/show.html.erb

SELECT  `properties`.* FROM `properties` WHERE `properties`.`user_id` = 2 AND `properties`.`user_id` IS NULL LIMIT 1
---
    <div>
      <% pnm = Property.find(@properties_visited) %>