app/views/favourites/index.html.erb

<% unless @user.favourites.empty? %>
---
SELECT  `favourites`.* FROM `favourites` WHERE `favourites`.`user_id` = 9 LIMIT 1