app/views/properties/_form.html.erb

SELECT  `reviews`.* FROM `reviews` WHERE `reviews`.`property_id` = 5 AND `reviews`.`status` = 'Approve' LIMIT 1
SELECT AVG(`reviews`.`rating`) FROM `reviews` WHERE `reviews`.`property_id` = 5 AND `reviews`.`status` = 'Approve'
---

<p>Overall Rating: <%= @property.reviews.where(status: "Approve").average(:rating) %></p>

SELECT  `reviews`.* FROM `reviews` WHERE `reviews`.`property_id` = 5 AND `reviews`.`id` = 5 LIMIT 1
---
</div>
<% @property.reviews.each do |r| %>