app/views/properties/index.html.erb

SELECT `properties`.* FROM `properties` WHERE `properties`.`user_id` = 2
---
  <table>
    <% @user.properties.each do |prop| %>