app/controllers/favourites_controller.rb

SELECT  `properties`.* FROM `properties` WHERE `properties`.`id` = NULL LIMIT 1
INSERT INTO `favourites` (`interested`, `user_id`, `property_id`, `created_at`, `updated_at`) VALUES (1, 4, 3, '2017-08-18 12:03:34', '2017-08-18 12:03:34')
UPDATE `favourites` SET `interested` = NULL, `updated_at` = '2017-08-18 18:33:07' WHERE `favourites`.`id` = 3
SELECT  `favourites`.* FROM `favourites` WHERE `favourites`.`property_id` = 6 AND `favourites`.`user_id` = 1 LIMIT 1
---
  def create
    @property = Property.find(params[:property_id])
    @favourite = @property.favourites.create(params.require(:favourite).permit(:interested))
    @favourite.user= current_user
    if @favourite.save
      msg = "Property added to your favourite List"
      if @favourite.interested
        flash[:success] = msg + " and Property is marked as Interested"
        UserMailer.property_interested(@property,current_user).deliver_now
      else
        flash[:success] = msg + " and Property is not marked as Interested"
      end
      redirect_to favourites_path
    else
      flash[:error] = @favourite.errors.full_messages.first

SELECT  `favourites`.* FROM `favourites` WHERE `favourites`.`id` = 3 LIMIT 1
UPDATE `favourites` SET `interested` = 0, `updated_at` = '2017-08-18 19:08:14' WHERE `favourites`.`id` = 3
SELECT  `properties`.* FROM `properties` WHERE `properties`.`id` = 7 LIMIT 1
---
  def update
    @favourite = Favourite.find(params[:id])
    if @favourite.update_attributes(params.require(:favourite).permit(:interested))
      msg = "Property Updated to your favourite List"
      if @favourite.interested
        flash[:success] = msg + " and Property is marked as Interested"
        UserMailer.property_interested(@favourite.property,current_user).deliver_now
      else
        flash[:success] = msg + " and Property is not marked as Interested"
      end
      redirect_to favourites_path
    else
      flash[:error] = @favourite.errors.full_messages.first

DELETE FROM `favourites` WHERE `favourites`.`id` = 6
SELECT  `favourites`.* FROM `favourites` WHERE `favourites`.`id` = 6 LIMIT 1
---
  def destroy
    Favourite.find(params[:id]).destroy