app/controllers/properties_controller.rb

SELECT `properties`.* FROM `properties`
---
  def home
    @properties = Property.all

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
INSERT INTO `properties` (`title`, `description`, `category`, `location`, `price`, `area`, `owner`, `contact`, `info`, `owner_type`, `city`, `rooms`, `created_at`, `updated_at`, `user_id`, `bedrooms`, `bathrooms`, `picture`) VALUES ('5bhk Flat picture', 'picture', 'Apartment', 'tollygunge', 40000, '600', 'Amit Mitra', '8906243814', 'For Rent', 'I have a Property', 'Kolkata', '4BHK+', '2017-08-13 18:47:38', '2017-08-13 18:47:38', 4, '5', '2', 'godrej_genesis.jpg')
UPDATE `properties` SET `status` = 'Needed' WHERE `properties`.`id` = 3
---
  def create
    @user = User.find(params[:user_id])
    @property = @user.properties.create(params.require(:property).permit(:title, :description, :category, :location, :price, :area, :owner, :contact, :info, :bedrooms, :bathrooms, :owner_type))
    if @property.owner_type == "I need a Property"
      @property.status = "Needed"
    end
    if @property.save

SELECT  `properties`.* FROM `properties` WHERE `properties`.`id` = 1 LIMIT 1
---
  def view
    @property = Property.find(params[:property_id])

SELECT  `properties`.* FROM `properties` WHERE `properties`.`id` = 2 LIMIT 1
---
  def edit

    @property = Property.find(params[:id])

SELECT  `properties`.* FROM `properties` WHERE `properties`.`id` = 2 LIMIT 1
UPDATE `properties` SET `title` = 'Flat for sell', `info` = 'Sell', `updated_at` = '2017-08-02 16:35:30' WHERE `properties`.`id` = 2
---
  def update
    @property = Property.find(params[:id])
    if @property.update_attributes(params.require(:property).permit(:title, :description, :category, :location, :price, :area, :owner, :contact, :info, :status, :bedrooms, :bathrooms))

DELETE FROM `properties` WHERE `properties`.`id` = 1
SELECT  `properties`.* FROM `properties` WHERE `properties`.`id` = 1 LIMIT 1
---
  def destroy
    Property.find(params[:id]).destroy

SELECT `properties`.* FROM `properties` WHERE `properties`.`info` = 'For Sale' AND `properties`.`owner_type` = 'I have a Property'
---
  def adminUser
    @properties_to_sale = Property.where( info: 'For Sale', owner_type: 'I have a Property' )

SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
SELECT  `properties`.* FROM `properties` WHERE `properties`.`user_id` = 2 AND `properties`.`id` = 2 LIMIT 1
---
  def show
    @user = User.find(current_user.id)
    @property = @user.properties.find(params[:id])