app/controllers/properties_controller.rb

SELECT  `favourites`.* FROM `favourites` WHERE `favourites`.`user_id` = 1 AND `favourites`.`property_id` = 7 LIMIT 1
---
  def show
    #@user = User.find(current_user.id)
    @property = Property.find(params[:id])
    unless current_user == @property.user
    @property.viewers = @property.viewers + 1
    @property.save
  end
    if logged_in?

      unless (current_user == @property.user)
        property_visited(@property)
         UserMailer.property_visited(@property,current_user).deliver_now
      end
    end

    @favourite = Favourite.find_by(user_id: current_user, property_id: @property)