app/controllers/reviews_controller.rb

  def index
    @reviews = Review.all
---
SELECT `reviews`.* FROM `reviews`

  def new

    @property = Property.find(params[:property_id])
---
SELECT  `properties`.* FROM `properties` WHERE `properties`.`id` = 5 LIMIT 1

  def create

    @property = Property.find(params[:property_id])
    @review = @property.reviews.create(params.require(:review).permit(:rating,:comment))
    @review.user_id = current_user.id
    if @review.save
---
SELECT  `properties`.* FROM `properties` WHERE `properties`.`id` = 4 LIMIT 1
INSERT INTO `reviews` (`title`, `comment`, `property_id`, `user_id`, `created_at`, `updated_at`) VALUES ('vslkvjnsklfj', 'kjklcjkldjc', 5, 4, '2017-08-09 06:31:20', '2017-08-09 06:31:20')
UPDATE `reviews` SET `user_id` = 4, `updated_at` = '2017-08-05 17:00:25' WHERE `reviews`.`id` = 8

def show
  @review = Review.find(params[:id])
---
SELECT  `reviews`.* FROM `reviews` WHERE `reviews`.`id` = NULL LIMIT 1

  def approval
    @review = Review.find(params[:review_id])
---
SELECT  `reviews`.* FROM `reviews` WHERE `reviews`.`id` = NULL LIMIT 1

  def approve
    @review = Review.find(params[:review_id])
    if @review.update_attributes(params.require(:review).permit(:status))
---
SELECT  `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 1 LIMIT 1
UPDATE `reviews` SET `status` = 'Approve', `updated_at` = '2017-08-12 17:35:35' WHERE `reviews`.`id` = 1

  def edit
    @review = Review.find(params[:id])
---
SELECT  `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 2 LIMIT 1

  def update
    @review = Review.find(params[:id])
    if @review.update_attributes(params.require(:review).permit(:rating, :comment))
---
SELECT  `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 7 LIMIT 1
UPDATE `reviews` SET `status` = 'Approve', `updated_at` = '2017-08-06 05:10:54' WHERE `reviews`.`id` = 7

  def destroy
    Review.find(params[:id]).destroy
---
DELETE FROM `reviews` WHERE `reviews`.`id` = 1
SELECT  `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 1 LIMIT 1