app/controllers/sessions_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`uid` = 'Prince' LIMIT 1
---
    def create
      user = User.find_by(email: params[:session][:email].downcase, provider: NIL)
      user_name = User.find_by(uid: params[:session][:uid])