app/controllers/sessions_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'amit@gmail.com' LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`name` = 'Prince' LIMIT 1
---
    def create
      user = User.find_by(email: params[:session][:email].downcase)
      user_name = User.find_by(name: params[:session][:name])