app/controllers/static_pages_controller.rb

  def home

      @properties_recent = Property.order(created_at: :desc).limit(5)
---
SELECT `properties`.* FROM `properties` WHERE (`properties`.`created_at` BETWEEN '2017-08-11 18:30:00' AND '2017-08-12 18:30:00')

  def search
    @search_properties_for = Property.where("(info = ? OR city = ? OR location = ? OR category = ? OR rooms = ?) OR (price BETWEEN ? AND ?)", params[:info], params[:city], params[:location], params[:type], params[:rooms], params[:min], params[:max])
---
SELECT `properties`.* FROM `properties` WHERE ((info = NULL OR city = '' OR location = '' OR category = NULL OR rooms = NULL) OR ((CONVERT(INT, CONVERT(DECIMAL(9, 0), ISNULL(price, 0)))) BETWEEN '200000000' AND '') AND (owner_type = 'I have a Property'))