app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
---
  def show
    @user = User.find(params[:id])

INSERT INTO `users` (`name`, `email`, `mobile`, `created_at`, `updated_at`, `password_digest`) VALUES ('Amit Mitra', 'amit@gmail.com', '1234567890', '2017-06-18 06:46:23', '2017-06-18 06:46:23', '$2a$10$4pFQtIVO0kuJLBu/.7aysObBKPNCXYk/E/dKKOnODX/ooCROULqXa')
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
---
  def edit
    @user = User.find(params[:id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `password_digest` = '$2a$10$Ika1/7Y/1BUddE3wTCIDmuM9EqrlBIZoXSTdogovg5NwUInvr9m.K', `updated_at` = '2017-07-18 07:22:41' WHERE `users`.`id` = 1
---
  def update
      @user = User.find(params[:id])
      if @user.update_attributes(user_params)

DELETE FROM `users` WHERE `users`.`id` = 4
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
    def destroy
      User.find(params[:id]).destroy